#include <iostream>

struct Cat {
    std::string name;
    int age;
};

using namespace std::literals;

int main() {
    Cat cat;
    cat.name = "Leopold"s;
    cat.age = 3;

    // Не меняйте код выше этой строки!

    // Выведите строку «X is now N years old», где X — имя кота, а N — его возраст.
    std::cout << cat.name << " is now " << cat.age << " years old" << std::endl;
    return 0;
}