Вы уже создали несколько полезных перегрузок для класса Rational: ввод и вывод значений, сложение и вычитание. Давайте добавим к ним ещё парочку!
Что нужно сделать
Реализуйте перегрузки унарного плюса и унарного минуса для Rational. Плюс должен возвращать копию объекта класса. Минус — копию объекта с противоположным знаком.
Пример работы операций:

Rational r{1, 2};
std::cout << +r << std::endl; // Выведет 1 / 2.
std::cout << -r << std::endl; // Выведет -1 / 2. 
В заготовке вам дан класс Rational с перегрузкой операции вывода, знакомой вам из задачи прошлого урока.
Как будет тестироваться код
Для тестирования будет использоваться функция main.
Примеры
Пример 1
Входные данные
1 / 2 
Результат
1 / 2
-1 / 2 
Пример 2
Входные данные
-5 / 9 
Результат
-5 / 9
5 / 9 
Пример 3
Входные данные
-5 / -7 
Результат
5 / 7
-5 / 7 
Пример 4
Входные данные
0 /5 
Результат
0 / 5
0 / 5 