Значения типа std::string поддерживают метод find — он ищет в строке заданную подстроку. Напомним, что метод find возвращает позицию, в которой была найдена строка, либо специальное значение std::string::npos, если строка не найдена.
Вот пример его использования:

std::string text = "How are you? How are the children?"s;
size_t pos = text.find("are"s); // Искать в строке text строку "are".
if (pos != std::string::npos) { // Если строка найдена.
    std::cout << "found at: "s << pos << std::endl;
} else {
    std::cout << "not found"s << std::endl;
}

// Будет выведено "found at: 4", так как
// искомая строка "are" будет обнаружена на 
// четвёртой позиции, если считать с нуля. 
Напомним также, что метод поддерживает второй параметр — с какой позиции начинать поиск:

std::cout << text.find("are"s, 4); // 4 — начали с позиции 4 и сразу же нашли.
std::cout << text.find("are"s, 5); // 17 — нашли второе слово "are".
std::cout << text.find("are"s, 18); // Большое число — npos. 
Однако метод find ищет только одно вхождение строки за раз. Было бы неплохо иметь функцию, способную найти сразу все.
Что нужно сделать
Напишите функцию std::vector<size_t> FindString(const std::string& text, const std::string& text_to_find). Она должна найти все вхождения строки text_to_find в строке text и возвратить вектор позиций в строке text. Если требуется искать пустую строку, то функция должна возвратить пустой вектор.
Для решения задачи вам понадобится цикл и переменная для хранения текущей позиции поиска. На каждой итерации find должен искать первое вхождение строки text_to_find, начиная с указанной позиции. 
Если результат поиска равен std::string::npos, это значит, что вхождений больше нет, и цикл можно прервать. 
Если вхождение найдено, его позиция добавляется в вектор, а текущая позиция поиска перемещается на один символ после начала найденной строки. Это позволит находить перекрывающиеся вхождения.
Ограничения
Объявление и определение функции FindString должны быть в файлах string_utils.h и string_utils.cpp.
Как будет тестироваться ваш код
Тренажёр проверит работу функции FindString. Также будет проверено, что вы разместили элементы программы в правильных файлах.
Примеры
Пример 1
Входные данные
to be or not to be
be 
Результат
3
16 
Объяснение
Строка "be" находится в тексте в позициях 3 и 16.
Пример 2
Входные данные
to be or not to be
beer 
Результат

 
Объяснение
Возвращён пустой вектор, так как строка не найдена.
Пример 3
Входные данные
aaaa
a 
Результат
0
1
2
3 
Объяснение
Строка из одного символа найдена 4 раза.
Пример 4
Входные данные
to be or not to be
to be or not to be 
Результат
0 
Объяснение
Нашли в строке саму себя в позиции 0.
Пример 5
Входные данные
abababa
aba 
Результат
0
2
4 
Объяснение
Нашли три вхождения, хотя они перекрываются.
Пример 6
Входные данные
aba
 
Результат

 
Объяснение
По условию задачи мы не находим пустую строку.