Добавим в программу возможность обработки ошибок. В ней используется пять функций:
DigitToChar,
NumberToString,
CharToDigit,
StringToNumber,
ConvertNotation.
Рассмотрим условия, при которых функция содержит ошибку.
В DigitToChar обработка ошибок не требуется.
NumberToString должна проверить, что задана допустимая система счисления.
CharToDigit проверяет, что символ может быть цифрой: находится между 0 и 9, либо между a и z, либо между A и Z.
StringToNumber – ошибка, если задана неправильная система счисления, или присутствует неверная цифра.
ConvertNotation вызывает StringToNumber и NumberToString. Она завершится неуспешно, если одна из этих функций сообщила об ошибке.
Сообщать об ошибке функции будут так:
StringToNumber сообщит об ошибке, используя выходной параметр bool& was_error.
CharToDigit — через возвращаемое значение -1.
NumberToString и ConvertNotation в случае ошибки вернут пустую строку.
Что нужно сделать
Измените NumberToString. Функция должна вернуть пустую строку, если система счисления меньше 2 или больше 36.
Измените CharToDigit. Функция должна вернуть -1, если символ не является цифрой ни в какой системе счисления.
Измените StringToNumber. Добавьте выходной параметр в сигнатуру:

   int StringToNumber(const std::string& s, int base, bool& was_error) {
       ...
   }
    
    Функция должна устанавливать в него значение true при ошибке: если система счисления меньше 2 или больше 36, либо если встретилась неправильная цифра. 
    Неправильной считается цифра, которая больше либо равна base, либо для которой функция CharToDigit вернула -1.
Измените ConvertNotation. Она должна возвратить пустую строку в случае ошибки. Ошибка возникает если StringToNumber установила флаг was_error, либо если NumberToString возвратила пустую строку.
Если в процессе преобразования строки произойдёт ошибка, программа вместо числа должна вывести строку ERROR. Используйте следующую заготовку функции main.

int main() {
    using namespace std::literals;
    std::string src_string;
    int src_base, dst_base;

    std::cin >> src_string >> src_base >> dst_base;

    if (auto result = ConvertNotation(src_string, src_base, dst_base); !result.empty()) {
        std::cout << result << std::endl;
    } else {
        std::cout << "ERROR"s << std::endl;
    }
} 
Как будет тестироваться код
Тренажёр проверит работу функций вашей программы, передавая им на вход как валидные, так и невалидные данные. Гарантируется, что число для перевода не будет выходить за пределы типа int.
Примеры
Пример 1
Входные данные
13 10 16 
Результат
D 
Объяснение
Число 13 в десятичной системе счисления — это число D в шестнадцатеричной.
Пример 2
Входные данные
D 16 10 
Результат
13 
Объяснение
Обратное преобразование.
Пример 3
Входные данные
121 2 10 
Результат
ERROR 
Объяснение
Число 121 содержит недопустимую в двоичной системе счисления цифру 2.
Пример 4
Входные данные
S 10 2 
Результат
ERROR 
Объяснение
Символ S недопустим.
Пример 5
Входные данные
12345 37 8 
Результат
ERROR 
Объяснение
Программа не поддерживает тридцатисемеричную систему счисления.
Пример 6
Входные данные
12345 8 99 
Результат
ERROR 
Объяснение
Программа не поддерживает девяностодевятеричную систему счисления.
Пример 7
Входные данные
A 10 5 
Результат
ERROR 
Объяснение
В десятичной системе счисления нет цифры A.
Пример 8
Входные данные
10bcd 16 4 
Результат
100233031 
Пример 9
Входные данные
100233031 4 16 
Результат
10BCD 
Пример 10
Входные данные
10bcd 16 4 
Результат
100233031 
Пример 11
Входные данные
100233031 4 16 
Результат
10BCD 