Раз можно упростить ввод-вывод значений для пары, почему бы не сделать это и для другого типа, с которым мы постоянно имеем дело? Да-да, речь снова о классе Rational.
Что нужно сделать
Напишите перегрузки для ввода и вывода дроби, хранящейся в классе Rational. Формат ввода должен быть таким: <число><необязательный пробел>/<необязательный пробел><число>. 

// Примеры корректного ввода.
1 / 2
0/5
-6 /-8 
При возникновении ошибки ввода значение дроби должно оставаться прежним, а поток — переводиться в ошибочное состояние. Если указанный знаменатель равен 0, это тоже считается ошибкой.
Знаменатель можно не указывать. В этом случае он считается равным 1. Например, при чтении числа 5 должна получиться дробь 5/1. Добиться этого можно так:
После числителя читаете символ.
Если не удалось прочитать, значит, знаменатель не указан. Уберите флаг ошибки потока методом clear и возвратите дробь.
Если удалось прочитать символ, но он отличен от /, то нужно возвратить символ в поток методом unget и вернуть дробь.
В противном случае нужно прочитать знаменатель.
Вывод дроби имеет такой же формат, как и ввод.

std::cout << r; // Вывод: 1 / 2. 
Если знаменатель равен 1, то его выводить не нужно, как и дробную черту:

Rational r{10, 1};

std::cout << r; // Вывод: 10. 
В заготовке вам дан класс Rational, для которого нужно дописать две функции перегрузок.
Ограничения
Помните, что функции, определяемые в заголовочных файлах, должны быть встроенными (inline).
Как будет тестироваться код
При проверке будет использоваться функция main, данная в заготовке.
Примеры
Пример 1
Входные данные
1 / 2 
Результат
1 / 2 
Пример 2
Входные данные
3 / -5 
Результат
3 / -5 
Пример 3
Входные данные
10 / 1 
Результат
10 
Пример 4
Входные данные
-7 / 1 
Результат
-7 
Пример 5
Входные данные
-42 
Результат
-42 
Пример 6
Входные данные
15 
Результат
15 
Пример 7
Входные данные
5 / 0 
Результат
Не удалось прочитать дробь. 
Пример 8
Входные данные
1 / 
Результат
Не удалось прочитать дробь. 
Пример 9
Входные данные
1 * 2 
Результат
1 

Подсказка