Перемещение треугольника
В этой задаче вам предстоит вычислить центр треугольника и переместить треугольник так, чтобы центр оказался в заданной точке.
Что нужно сделать
Напишите функцию Point GetCenter(const Triangle& t), которая возвращает центр треугольника t. Координаты центра треугольника равны среднему арифметическому координат его вершин:

x = (t.p1.x + t.p2.x + t.p3.x) / 3;
y = (t.p1.y + t.p2.y + t.p3.y) / 3; 
Напишите функцию void MovePoint(Point& p, Vector2D v), которая сдвигает точку p на величину вектора v. Для сдвига точки 
P
P прибавьте к её координатам соответствующие координаты вектора 
v
⃗
v
 . Координаты сдвинутой точки будут равны:

p.x += v.x;
p.y += v.y; 
Напишите функцию void MoveTriangle(Triangle& t, Vector2D v), которая сдвигает треугольник t вдоль вектора v. Чтобы сдвинуть треугольник, нужно сдвинуть все его вершины. В функции MoveTriangle используйте функцию MovePoint. Чтобы вычислить вектор смещения центра масс, используйте функцию PointDifference.
Напишите функцию void PrintTriangle(const Triangle& t), которая выводит в стандартный поток вывода информацию о треугольнике в следующем формате:

{{X1, Y1}, {X2, Y2}, {X3, Y3}} 
 Здесь:
X1, Y1 — координаты первой вершины,
X2, Y2 — координаты второй вершины,
X3, Y3 — координаты третьей вершины треугольника.
В функции PrintTriangle используйте функцию PrintPoint.
Ограничения
Для написания требуемых функций используйте функции из предыдущих задач.
Как будет тестироваться код
Тренажёр проверит работу функций GetCenter, MovePoint, MoveTriangle, PrintTriangle, а также проверит, что программа корректно обрабатывает входные данные из stdin и выводит верный результат в stdout.
Для проверки будет использоваться такая функция main:

void PrintVector(Vector2D p) {
    std::cout << "("s << p.x << ", "s << p.y << ")"s;
}

int main() {
    Triangle t = ReadTriangle();

    // Исходный центр треугольника.
    Point origin = GetCenter(t);

    // Читаем желаемый центр треугольника.
    Point center = ReadPoint();

    // Находим смещение центра треугольника.
    Vector2D offset = PointDifference(center, origin);

    std::cout << "Исходный центр: ";
    PrintPoint(origin);
    std::cout << std::endl;

    std::cout << "Смещение: ";
    PrintVector(offset);
    std::cout << std::endl;
    
    MoveTriangle(t, offset);
    PrintTriangle(t);
    std::cout << std::endl;
} 
В первых трёх строках стандартного потока ввода подаются координаты трёх вершин треугольника: вещественные числа, разделённые пробелом. В четвёртой строке — координаты нового центра масс. Программа выведет информацию о сдвинутом треугольнике, используя функцию PrintTriangle. Ориентируйтесь на примеры.
Дополнительные сведения для любознательных
Примеры
Пример 1
Входные данные
-2 -1
1 4
2.5 -1.5
-3 -1 
Результат
Исходный центр: {0.5, 0.5}
Смещение: (3.5, 1.5)
{{1.5, 0.5}, {4.5, 5.5}, {6, 0}} 
Пример 2
Входные данные
0 0
3 0
0 3
1 1 
Результат
Исходный центр: {1, 1}
Смещение: (0, 0)
{{0, 0}, {3, 0}, {0, 3}} 
Пример 3
Входные данные
-5 0
3 0
2 3.5
8 -10.5 
Результат
Исходный центр: {0, 1.16667}
Смещение: (-8, 11.6667)
{{-13, 11.6667}, {-5, 11.6667}, {-6, 15.1667}} 