Треугольник
Три точки на плоскости образуют треугольник. Вам понадобится вычислить периметр треугольника.
Что нужно сделать
Опишите в программе структуру Triangle, которая моделирует треугольник. Его полями должны быть точки с именами p1, p2, p3.
Напишите функцию Triangle ReadTriangle(), которая считывает из стандартного потока ввода координаты трёх точек треугольника. Они располагаются на трёх строках, между собой координаты разделены пробелом. Ориентируйтесь на примеры.
Напишите функцию double FindPerimeter(const Triangle& t), которая вычисляет и возвращает периметр треугольника.
Для нахождения длин сторон треугольника воспользуйтесь функциями, которые вы написали в предыдущей задаче.
Как будет тестироваться код
Тренажёр проверит, что:
в задаче есть структура Triangle с нужными полями;
в задаче есть функции ReadTriangle и FindPerimeter с нужными сигнатурами;
функции, упомянутые выше, ничего не выводят.
Затем будут запущены тесты.
При тестировании будет использоваться следующий main:

int main() {
    Triangle t = ReadTriangle();
    std::cout << FindPerimeter(t) << std::endl;
} 
Дополнительные сведения для любознательных
Примеры
Пример 1
Входные данные
3 0
0 0
0 4 
Результат
12 
Пример 2
Входные данные
1 0
4 0
2.5 2 
Результат
8 