В этой задаче вы потренируетесь в создании функций для преобразования строк. Первая функция будет получать строку и выводить её в верхнем регистре. Вторая функция будет работать аналогично, но использовать нижний регистр.
Что нужно сделать
Напишите две функции:
PrintUpper — принимает в качестве параметра строку и печатает её в верхнем регистре.
PrintLower — принимает в качестве параметра строку и печатает её в нижнем регистре.
Для преобразования символов вам пригодятся функции std::toupper и std::tolower из заголовочного файла cctype. Использовать их можно следующим образом:

#include <cctype>

int main() {
    std::cout << static_cast<char>(std::toupper('a')); // Преобразует 'a' в 'А'.
    std::cout << static_cast<char>(std::tolower('R')); // Преобразует 'R' в 'r'.
} 
std::toupper и std::tolower принимают и возвращают значение типа int — так сложилось по историческим причинам. Эти функции идут ещё из языка C. Чтобы получить значение типа char, нужно использовать static_cast<char>.
Функции std::toupper и std::tolower умеют работать только с одним символом за раз. Чтобы преобразовать строку, используйте цикл по её символам, преобразовывая и выводя их по одному. После цикла не забудьте вывести std::endl.
Ограничения
В программе должны быть функции PrintUpper и PrintLower, принимающие один параметр типа std::string.
В функции main не должно быть выводов в std::cout, но могут быть вызовы функции.
Как будет тестироваться код
Тесты проверят, корректно ли реализуются функции и выполнены ли ограничения.
На вход будут подаваться строки, состоящие только из ASCII-символов.
Функция main при проверке учитываться не будет.
Примеры
Пример 1
Входные данные
hello function! 
Результат
HELLO FUNCTION!
hello function! 
Пример 2
Входные данные
AnOtHeR eXaMpLe! 
Результат
ANOTHER EXAMPLE!
another example! 
Пример 3
Входные данные

 
Результат

 
Объяснение
Ввели пустую строку — и на выходе должны получить две пустые строки.