Ранее вы написали две функции: PrintLower и PrintUpper, которые выводили текст в нижнем и верхнем регистре. Однако у этих функций есть один существенный недостаток: они выполняют сразу две задачи — меняют регистр и печатают строку.
Согласно негласному правилу программирования, функция должна иметь только одну зону ответственности и не взаимодействовать с интерфейсом пользователя без крайней необходимости. Было бы гораздо удобнее иметь функцию, которая только изменяет регистр строки, но не печатает её, а возвращает результат обратно. Тогда мы можем сохранить этот результат в переменной, вывести его на консоль или использовать в других целях по своему усмотрению.
Что нужно сделать
Напишите функции ToLower и ToUpper, которые принимают строку для преобразования – параметр типа std::string, меняют её регистр и возвращают новый вариант строки.
Для изменения регистра используйте тот же подход, который был в реализации PrintLower и PrintUpper: переберите в цикле все символы, преобразовывая их с помощью std::toupper и std::tolower. Создайте переменную для результирующей строки и вместо того, чтобы выводить новые символы, записывайте их в эту переменную.
Пример использования функции ToUpper:

std::string new_str = ToUpper("hello world"); 
std::cout << new_str << std::endl; // HELLO WORLD. 
Примеры
Пример 1
Входные данные
MeW 
Результат
Upper: MEW
Lower: mew 
Пример 2
Входные данные
mew mew!! 
Результат
Upper: MEW MEW!!
Lower: mew mew!! 
Пример 3
Входные данные
_mew_ 
Результат
Upper: _MEW_
Lower: _mew_ 
Пример 4
Входные данные
*** 
Результат
Upper: ***
Lower: *** 