Точка и вектор
Если соединить две точки, то получится вектор. У вектора есть начало и конец, а значит, можно найти его длину. Сделайте это.
Что надо сделать
Объявите структуру Vector2D с полями x и y типа double, которые по умолчанию равны нулю. Эта структура похожа на Point, но её объекты несут другой смысл — это проекции вектора. Они представляют собой разницу между координатами его начальной и конечной точек.
Напишите функцию PointDifference, которая вычисляет вектор разности точек p2 и p1 и возвращает его. Вектор разности должен иметь значения p2.x - p1.x и p2.y - p1.y. Сигнатура должна быть такой:

Vector2D PointDifference(Point p1, Point p2); 
Напишите функцию PrintVector. Она должна выводить в стандартный поток вывода проекции вектора в формате: (X, Y), где X и Y — проекции. Между проекциями следует выводить запятую и пробел. В функции не нужно выводить манипулятор endl. Сигнатура должна быть такой:

void PrintVector(Vector2D v); 
Напишите функцию FindLength, которая вычисляет и возвращает длину вектора v. Длину вектора можно вычислить с помощью функции std::hypot как std::hypot(v.x, v.y). Это функция из заголовочного файла <cmath>. Сигнатура должна быть такой:

double FindLength(Vector2D v); 
Как будет тестироваться код
Тренажёр проверит, что вы определили функции PointDifference, PrintVector и FindLength с правильными сигнатурами, затем будут запущены тесты.
При проверке вашей программы будет использоваться такая функция main:

int main() {
    Point p1 = ReadPoint();
    Point p2 = ReadPoint();
    Vector2D v = PointDifference(p1, p2);

    PrintVector(v);
    std::cout << std::endl;

    std::cout << FindLength(v) << std::endl;
} 
Дополнительные сведения для любознательных
Примеры
Пример 1
Входные данные
-1.0 6.0
2.0 10.0 
Результат
(3, 4)
5 
Пример 2
Входные данные
1 2
3 4 
Результат
(2, 2)
2.82843 