В этой задаче вы сделаете полноценный конвертер, который будет переводить строковое представление числа из одной системы счисления в другую.
У вас уже готова функция StringToNumber, которая может превращать значение, записанное в любой системе счисления, в число int. Для решения этой задачи вам дополнительно понадобится обратная функция — NumberToString. Она преобразует заданное число типа int в строковое представление в заданной системе счисления. Вы можете написать эту функцию самостоятельно или взять готовую реализацию по ссылке.
Что нужно сделать
Напишите функцию ConvertNotation, которая переводит строковое представление числа из одной системы счисления в другую. Вот сигнатура функции:

// Преобразовывает число src_number, записанное в системе счисления src_base,
// в строковое представление этого же числа в системе счисления dst_base.
std::string ConvertNotation(std::string src_number, int src_base, int dst_base) {
    // Напишите тело функции самостоятельно.
} 
С помощью этой функции можно перевести число из исходной системы счисления в конечную:

int main() {
    std::string src_string;
    int src_base, dst_base;

    std::cin >> src_string >> src_base >> dst_base;

    std::cout << ConvertNotation(src_string, src_base, dst_base) << std::endl;
} 
Для решения этой задачи используйте следующий алгоритм:
Переведите значение из std::string в int, воспользовавшись функцией StringToNumber.
Переведите полученное число в строку, используя NumberToString.
Ограничения
Функции NumberToString и ConvertNotation в возвращаемых значениях должны использовать только заглавные буквы.
Как будет тестироваться код
Тренажёр вызовет функции ConvertNotation с различными входными значениями и сравнит результат с ожидаемым.
Гарантируется, что начальная и конечная системы счисления находятся в диапазоне от 2 до 36, а строка содержит символы, допустимые в начальной системе счисления. 
Примеры
Пример 1
Входные данные
10 10 16 
Результат
A 
Объяснение
В шестнадцатеричной системе число 10 записывается одним знаком A.
Пример 2
Входные данные
A 16 10 
Результат
10 
Объяснение
Обратное преобразование числа A — из шестнадцатеричной системы в десятичную.
Пример 3
Входные данные
11011 2 16 
Результат
1B 
Объяснение
Двоичное число 11011 — это 27 в десятичной и 1B в шестнадцатеричной системе счисления.
Пример 4
Входные данные
1001 2 3 
Результат
100 
Объяснение
Двоичное число 1001 — это 9 в десятичной системе и 100 в троичной.
Пример 5
Входные данные
0 20 30 
Результат
0 
Объяснение
В любой системе счисления ноль записывается как ноль.
Пример 6
Входные данные
1 20 30 
Результат
1 
Пример 7
Входные данные
01 10 10 
Результат
1 